module.exports.config = {
  name: "rules",
  version: "1.0.0",
  Permssion: 0,
  credits: "Islamick Chat",
  prefix:false,
  description: "important notes",
  category: "random-img",
  usages: "send message",
  cooldowns: 5,
  dependencies: {
      "request": "",
      "fs-extra": "",
      "axios": ""
  }
};

module.exports.run = async({ api, event, args, client, Users, Threads, __GLOBAL, Currencies }) => {
  const axios = global.nodemodule["axios"];
  const request = global.nodemodule["request"];
  const fs = global.nodemodule["fs-extra"];
  var ZiaRein3 = (`⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n•—»✨আসসালামু আলাইকুম🖤💫

•—»✨ এটি একটি ইসলামিক গ্রুপ এবং আমি একটি ইসলামিক রোবোট🤖🕋\n আর এই ইসলামিক গ্রুপ এর কিছু নিয়ম কানুন আছে যা হয় তো বা এই গ্রুপ এর অনেক এর জানা নেই তাই \n আমি নিচে পয়েন্ট আকারে সেই নিয়ম গুলি আপনাদের জানিয়ে দিলাম - আসা করি কেও নিওম বঙ্গ করবেন নাহ - তা না হলে গ্রুপ থেকে বেরিয়ে যেতে পড়েন না হলে - আপনাকে গ্রুপ থেকে বের করে দেওয়া হবে-!!


⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆


🕋 ｢১｣ যেহেতু এটি একটি ইসলামিক গ্রুপ তো কোনো প্রকার খারাপ ভাষা ব্যবহার করা যাবে নাহ-!!🥺

🕋 ｢২｣ পর্ণ কিংবা বাজে ভিডিও দেওয়া যাবে নাহ 

🕋 ｢৩｣ এতো সুন্দর ইসলামিক গ্রুপ এ আছে আল্লাহর সুক্রিয়া করুন - এবং সবাই কে সম্মান দিন 

🕋 ｢৪｣ বড় হক কিংবা ছোট কাওকে ছোট করে কথা বলা যাবে নাহ 

🕋 ｢৫｣ এখানে ইসলাম এর বাহিরে কোনো কথা বলা যাবে নাহ 

🕋 ｢৬｣ ভাই অনেক কষ্ট করে এডমিন গ্রুপ + রোবোট বানিয়েছে তো দয়া করে  এডমিন কে - সম্মান দিবেন 

🕋 ｢৭｣ এডমিন খুব ভালো মানুষ আপনার যে কোনো বট এর ফাইল লাগলে তাকে ইনবক্স করবেন 

🕋 ｢৮｣ এখানে জগরা করা সম্পুর্ন নিষেধ - কেনো না জগরা করলে শয়তান খুসি হন 

🕋 ｢৯｣ এই গ্রুপ এই ইসলামিক রোবোট ছাড়া অন্য কোনো- রোবোট অ্যাড করা যাবে নাহ 

🕋 ｢১০｣ ১৮+ নিয়ে আসলে বা ১৮+ পর্ণ নিয়ে কোনো কথা বললে সাথে সাথে গ্রুপ থেকে বের করে দেওয়া হবে 

🕋 ｢১১｣ সকল ধর্ম লোক এখানে থাকতে পারবে শুধু মাত্রো - কারো ধর্ম যে নিয়ে কাওকে ছোট করা যাবে নাহ - এটা একটি শিক্ষনিয় বট এর থেকে সবাই আমারা ভালো  শিক্ষা নিতে আসেছি

🕋 ｢১২｣ কেও এক ইমজি বার বার দিবেন নাহ - দয়া করে 🥺

🕋 ｢১৩｣ গ্রুপ এর নাম  গ্রুপ ছোবি কিছু পরিবর্তন করা যাবে নাহ - একমাত্র এডমিন অনুমতি ছাড়া

🕋 ｢১৪｣ গ্রুপে কোন স্পাম মেসেজ করা যাবে নাহ-!!😤
🕋 ｢১৫｣ গ্রুপ এ কোন প্রোকার ফিসিং লিংক বা নাসা হেগার এর কোন  লিংক দেওয়া যাবেনা

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

❤️🌸প্রিয় আমার মুসলিম ভাই | বোন তুমাদের জন্য এতো কষ্ট করে ইসলামক গ্রুপ এবং রোবোট বানিয়েছি আল্লাহে কে ভালো বসলে - এই গ্রুপ ছেরে যেও নাহ 🥺💙 আর গ্রুপ এর নিওম গুলো মেনে চলো 

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

৫ ওয়াক্তো নামাজ পরো আল্লাহ কে ডাকো - কেনো নাহ - হাসর এর ময়দানে  | বিচার এর কারবালায় এক মাত্রো আল্লাহ-ই- পারবেন তুমাকে জাহান্নামের সেই ভয়াবহ আগুন থেকে রক্ষা করতে 🥺🤲
⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆
            ‌
দোয়া রইলো তুমাদের জন্য প্রিয় গ্রুপ এর মেম্বার রা-!!❤️🤲

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n`);
 var ZiaRein = [
"https://i.imgur.com/NuQMY5X.jpeg",
  ];
  var ZiaRein2 = () => api.sendMessage({ body: ZiaRein3, attachment: fs.createReadStream(__dirname + "/cache/ZiaRein1.jpg")}, event.threadID, () => fs.unlinkSync(__dirname + "/cache/ZiaRein1.jpg"), event.messageID);
  return request(encodeURI(ZiaRein[Math.floor(Math.random() * ZiaRein.length)])).pipe(fs.createWriteStream(__dirname + "/cache/ZiaRein1.jpg")).on("close", () => ZiaRein2());
};
